app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@yb3m.local'
 LIMIT 1
---
    public function attemptLogin()
    {
        $user = (new UserModel())->where('email', $this->request->getPost('email'))->first();

INSERT INTO `users` (`name`, `email`, `phone`, `password_hash`, `role`, `is_active`, `created_at`, `updated_at`) VALUES ('User Uji', 'useruji@example.com', '081200000001', '$2y$10$6eZ5FLjH1qKfaWRcrYaoVO9hB378yFE5S6oJbQw/psYOtCMqXbuYW', 'user', 1, '2026-05-08 13:25:39', '2026-05-08 13:25:39')
SELECT *
FROM `users`
WHERE `users`.`id` = 2
---
    public function attemptRegister()
    {
        $rules = [
            'name'     => 'required|min_length[3]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[8]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Mohon periksa kembali data pendaftaran.');
        }

        $userModel = new UserModel();
        $userId = $userModel->insert([
            'name'          => $this->request->getPost('name'),
            'email'         => $this->request->getPost('email'),
            'phone'         => $this->request->getPost('phone'),
            'password_hash' => password_hash((string) $this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'          => 'user',
            'is_active'     => 1,
        ], true);

        $user = $userModel->find($userId);