app/Controllers/DashboardController.php

    public function user(): string
    {
        $user = auth_user();
        $donations = (new DonationModel())
            ->where('user_id', $user['id'])
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT *
FROM `donations`
WHERE `user_id` = '2'
ORDER BY `id` DESC

    public function admin(): string
    {
        $donationModel = new DonationModel();

        return view('dashboard/admin', $this->basePageData([
            'title'         => 'Dashboard Admin',
            'description'   => 'Kelola donasi, user, program, dan galeri.',
            'authUser'      => auth_user(),
            'donationCount' => $donationModel->countAllResults(),
            'totalRaised'   => $donationModel->selectSum('amount')->first()['amount'] ?? 0,
            'userCount'     => (new UserModel())->countAllResults(),
            'programCount'  => (new ProgramModel())->countAllResults(),
            'galleryCount'  => (new GalleryModel())->countAllResults(),
            'donations'     => $donationModel->orderBy('id', 'DESC')->findAll(20),
---
SELECT COUNT(*) AS `numrows`
FROM `donations`
SELECT SUM(`amount`) AS `amount`
FROM `donations`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `programs`
SELECT COUNT(*) AS `numrows`
FROM `galleries`
SELECT *
FROM `donations`
ORDER BY `id` DESC
 LIMIT 20