app/Controllers/Home.php

SELECT *
FROM `galleries`
WHERE `is_published` = 1
AND `category` = 'home'
ORDER BY `id` ASC
---
    public function index(): string
    {
        $galleryModel = new GalleryModel();

        return view('pages/home', $this->pageData([
            'title'          => 'Beranda',
            'description'    => 'Website resmi Yayasan Bakti Mulya Masyarakat Mandiri untuk profil yayasan, galeri kegiatan, dan donasi digital.',
            'bismillah'      => 'بِسْــــــــــــــمِ اللهِ الرَّحْمَنِ الرَّحِيْـــــم',
            'greeting'       => 'السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُه.',
            'closing'        => 'وَالسَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُه.',
            'verse'          => 'Dan apabila hamba-hamba-Ku bertanya kepadamu (Muhammad) tentang Aku, maka sesungguhnya Aku dekat. Aku kabulkan permohonan orang yang berdoa apabila dia berdoa kepada-Ku. Hendaklah mereka itu memenuhi (perintah)-Ku dan beriman kepada-Ku, agar mereka memperoleh kebenaran. (QS. Al-Baqarah: 186)',
            'heroSlides'     => $galleryModel->where('is_published', 1)->where('category', 'home')->orderBy('id', 'ASC')->findAll(),

SELECT *
FROM `programs`
ORDER BY `id` DESC
---
    public function programs(): string
    {
        $programModel = new ProgramModel();

        return view('pages/programs', $this->pageData([
            'title'       => 'Program',
            'description' => 'Ringkasan program utama Yayasan Bakti Mulya Masyarakat Mandiri yang dapat terus dikembangkan seiring perjalanan yayasan.',
            'programs'    => $programModel->orderBy('id', 'DESC')->findAll(),

SELECT *
FROM `programs`
WHERE `status` = 'aktif'
ORDER BY `id` DESC
---
    public function donation(): string
    {
        $programModel = new ProgramModel();
        $midtrans = new MidtransGateway();

        return view('pages/donation', $this->pageData([
            'title'           => 'Donasi',
            'description'     => 'Salurkan donasi terbaik Anda untuk mendukung program Yayasan Bakti Mulya Masyarakat Mandiri.',
            'programOptions'  => $programModel->where('status', 'aktif')->orderBy('id', 'DESC')->findAll(),